## Анализ нескольких связанных датафреймов

In [2]:
import pandas as pd

In [3]:
df_p = pd.read_csv('C:/Users/Пользователь/Desktop/Python/Pandas_ данные для курса/Products.csv', sep = ';')
df_c = pd.read_csv('C:/Users/Пользователь/Desktop/Python/Pandas_ данные для курса/Customers.csv', sep = ';')
df_o = pd.read_csv('C:/Users/Пользователь/Desktop/Python/Pandas_ данные для курса/Orders.csv', sep = ';')
df_od = pd.read_csv('C:/Users/Пользователь/Desktop/Python/Pandas_ данные для курса/Order_details.csv', sep = ';')
df_e = pd.read_excel('C:/Users/Пользователь/Desktop/Python/Pandas_ данные для курса/Employees.xlsx')

In [4]:
df_e.head()

,EmployeeID,FirstName,LastName,Title,TitleOfCourtesy,BirthDate,HireDate,Address,HomePhone
0,1,Nancy,Davolio,Sales Representative,Ms.,1948-12-08 00:00:00.000,1992-05-01 00:00:00.000,507 - 20th Ave. E. Apt. 2A,(206) 555-9857
1,2,Andrew,Fuller,"Vice President, Sales",Dr.,1952-02-19 00:00:00.000,1992-08-14 00:00:00.000,908 W. Capital Way,(206) 555-9482
2,3,Janet,Leverling,Sales Representative,Ms.,1963-08-30 00:00:00.000,1992-04-01 00:00:00.000,722 Moss Bay Blvd.,(206) 555-3412
3,4,Margaret,Peacock,Sales Representative,Mrs.,1937-09-19 00:00:00.000,1993-05-03 00:00:00.000,4110 Old Redmond Rd.,(206) 555-8122
4,5,Steven,Buchanan,Sales Manager,Mr.,1955-03-04 00:00:00.000,1993-10-17 00:00:00.000,14 Garrett Hill,(71) 555-4848

In [5]:
df_c.head()

,CustomerID,ContactName,ContactTitle,Phone,Address
0,ALFKI,Maria Anders,Sales Representative,030-0074321,Obere Str. 57
1,ANATR,Ana Trujillo,Owner,(5) 555-4729,Avda. de la Constitucion 2222
2,ANTON,Antonio Moreno,Owner,(5) 555-3932,Mataderos 2312
3,AROUT,Thomas Hardy,Sales Representative,(171) 555-7788,120 Hanover Sq.
4,BERGS,Christina Berglund,Order Administrator,0921-12 34 65,Berguvsv?gen 8

Объединить должности из разных таблиц в один список

In [6]:
df_e['Title']

0        Sales Representative
1       Vice President, Sales
2        Sales Representative
3        Sales Representative
4               Sales Manager
5        Sales Representative
6        Sales Representative
7    Inside Sales Coordinator
8        Sales Representative
Name: Title, dtype: object

In [11]:
# Список в датафрейм
a = pd.DataFrame({'Title':df_e['Title']})

In [12]:
df_c['ContactTitle']

0          Sales Representative
1                         Owner
2                         Owner
3          Sales Representative
4           Order Administrator
                ...
86           Accounting Manager
87                Sales Manager
88                        Owner
89    Owner/Marketing Assistant
90                        Owner
Name: ContactTitle, Length: 91, dtype: object

In [15]:
# Список в датафрейм
b = pd.DataFrame({'Title':df_c['ContactTitle']})

In [21]:
# Объединим два списка
c = pd.concat([a,b])

In [22]:
c

                        Title
0        Sales Representative
1       Vice President, Sales
2        Sales Representative
3        Sales Representative
4               Sales Manager
..                        ...
86         Accounting Manager
87              Sales Manager
88                      Owner
89  Owner/Marketing Assistant
90                      Owner

[100 rows x 1 columns]

In [23]:
# Серия
pd.concat([df_e['Title'],df_c['ContactTitle']])

0          Sales Representative
1         Vice President, Sales
2          Sales Representative
3          Sales Representative
4                 Sales Manager
                ...
86           Accounting Manager
87                Sales Manager
88                        Owner
89    Owner/Marketing Assistant
90                        Owner
Length: 100, dtype: object

In [27]:
# Датафрейм
df2 = pd.DataFrame({'Title':pd.concat([df_e['Title'],df_c['ContactTitle']])})

In [29]:
df2

                        Title
0        Sales Representative
1       Vice President, Sales
2        Sales Representative
3        Sales Representative
4               Sales Manager
..                        ...
86         Accounting Manager
87              Sales Manager
88                      Owner
89  Owner/Marketing Assistant
90                      Owner

[100 rows x 1 columns]

C помощью метода .concat() объедините должности сотрудников и должности клиентов. Сколько человек состоят в должности Sales Representative?

In [30]:
# Первый вариант решения 
df2[df2['Title'] == 'Sales Representative'].count()

Title    23
dtype: int64

In [31]:
# Второй вариант решения
c.value_counts().reset_index()

                             Title  count
0             Sales Representative     23
1                            Owner     17
2                Marketing Manager     12
3                    Sales Manager     12
4               Accounting Manager     10
5                  Sales Associate      7
6              Marketing Assistant      6
7                      Sales Agent      5
8            Assistant Sales Agent      2
9              Order Administrator      2
10  Assistant Sales Representative      1
11        Inside Sales Coordinator      1
12       Owner/Marketing Assistant      1
13           Vice President, Sales      1